{
    "fund": "Short name or identifier of the investment fund.",
    "forecastirr": "Projected internal rate of return (IRR) for the fund based on current forecasts, expressed as a percentage.",
    "forecast_moic": "Projected multiple on invested capital (MOIC) under forecast assumptions.",
    "current_irr": "Most recently calculated internal rate of return for the fund, expressed as a percentage.",
    "current_moic": "Current multiple on invested capital based on realised and unrealised values to date.",
    "geography": "Primary regional focus of the fund’s investments.",
    "sector": "Industry sector focus of the fund.",
    "asset": "Type or strategy of the asset class (e.g., PE - Buyout, VC, Hedge Fund).",
    "nature": "Describes whether the investment is private, public, secondary, etc.",
    "investment_date": "Date on which the capital commitment to the fund was made or investment commenced.",
    "committed": "Total capital commitment made by the limited partner in original fund currency. **Do not use it to calculate total investment amount.**",
    "funded": "Cumulative capital that has actually been called (drawn down) to date.",
    "o_s": "Outstanding capital yet to be funded (negative indicates over-funding).",
    "distribution": "Total cash and stock distributions returned to the investor to date.",
    "current_mtm_value": "Current mark-to-market valuation of the remaining interest in the fund.",
    "total_earned": "Net gain or loss realised to date (distributions plus unrealised value minus contributions).",
    "fund_full_name": "Legal name of the investment fund.",
    "initial_closing_date": "Date of the fund’s first closing when it began accepting investor commitments.",
    "final_closing_date": "Date of the fund’s final closing when fundraising ended.",
    "vintage_year": "Calendar year in which the fund started investing (vintage).",
    "general_partner_gp": "Legal entity acting as the fund’s general partner.",
    "investment_manager": "Firm responsible for managing the fund’s assets.",
    "fund_term": "Contractual life of the fund stated in the limited partnership agreement.",
    "extensions": "Permitted extension periods to the original fund term.",
    "investment_period": "Defined period during which the GP can call capital for new investments.",
    "fund_currency": "Reference currency of the fund.",
    "fund_size_total_commitment": "Total committed capital to the fund from all investors, as stated by the GP.",
    "minimum_commitment": "Minimum subscription amount required from any limited partner.",
    "gp_commitment": "Capital committed by the general partner to the fund.",
    "financial_year_end": "Fiscal year-end date used for the fund’s reporting.",
    "accounting_principles": "Accounting standard followed for the fund’s financial statements (e.g., US GAAP).",
    "fund_performance_indicator": "Qualitative or proprietary performance rating assigned to the fund.",
    "fair_value_of_porfolio_companies_usdol_mil": "Fair value of the underlying portfolio companies in millions of U.S. dollars.",
    "total_net_asset_value_usdol_mil": "Latest net asset value (NAV) of the fund in millions of U.S. dollars.",
    "fund_gross_multiple_x": "Gross multiple of invested capital before fees and carry.",
    "fund_net_multiple_x": "Net multiple of invested capital after fees and carry.",
    "fund_gross_irr_pct": "Gross IRR of the fund before fees and carried interest.",
    "fund_net_irr_pct": "Net IRR to limited partners after fees and carried interest.",
    "fund_distribution_to_paid_in_capital_dpi_pct": "Fund-level DPI (Distributions to Paid-In Capital) expressed as a percentage.",
    "ccg_performance_indicator": "Custom classification code or rating used by the bank for performance monitoring.",
    "commitment_usdol_mil": "Investor’s capital commitment to the fund expressed in millions of USD. Do not use it to calculate total investment amount. **Do not use it to calculate total investment amount.**",
    "ownership_pct": "Investor’s percentage ownership of total fund commitments.",
    "remaining_unfunded_commitment_usdol_mil": "Uncalled portion of the investor’s commitment in millions of USD.",
    "cumulative_distribution_usdol_mil": "Total cash and stock returned to the investor to date in millions of USD.",
    "capital_account_balance_usdol_mil": "Investor’s current capital account balance (NAV) in millions of USD.",
    "call_up_percentage_pct": "Percentage of the investor’s commitment that has been called to date.",
    "distribution_to_paid_in_capital_dpi_pct": "Investor-level DPI ratio expressed as a percentage.",
    "multiple_x": "Investor-level multiple on invested capital (TVPI or MOIC).",
    "irr_pct": "Investor-level internal rate of return.",
    "fee_term": "Summary of management fee structure set out in the partnership agreement.",
    "management_fees_investment_period": "Management fee rate applicable during the investment period.",
    "management_fees_after_investment_period": "Management fee rate applicable after the investment period ends.",
    "preferred_return": "Preferred return (hurdle rate) promised to limited partners before carry is paid.",
    "carried_interest": "Percentage of profits allocated to the general partner as carried interest.",
    "lp_reporting_timeline": "Agreed timeline or requirements for LP reporting deliverables.",
    "quarterly_report_after_period_end": "Number of days after quarter-end by which the GP must deliver a report.",
    "annual_report_after_period_end": "Number of days after year-end by which the GP must deliver the annual report.",
    "drawdown_notice": "Notice period required before capital is called from investors.",
    "dpi_x": "Distribution to Paid-In Capital multiple (DPI) expressed as a factor (x).",
    "rvpi_x": "Residual Value to Paid-In Capital multiple (RVPI) expressed as a factor (x).",
    "tvpi_moic_x": "Total Value to Paid-In Capital or MOIC multiple (TVPI) expressed as a factor (x).",
    "irr": "Another representation of the internal rate of return, possibly at the deal or currency level.",
    "upside": "Absolute unrealised gain in currency terms, reflecting potential upside.",
    "total": "Text or flag field summarising total status or allocation group (context-specific).",
    "moic": "Another field for multiple on invested capital, possibly a duplicate or alternative view.",
    "irr_1": "Alternative IRR calculation (e.g., forecast, deal-level, or different currency basis).",
    "inception": "Inception date of the investor’s commitment or share class.",
    "expiry": "Contractual expiry date of the fund or of the specific commitment.",
    "entity": "Legal entity through which the investor is investing (e.g., feeder vehicle).",
    "fee_pct": "Management fee rate expressed as a percentage.",
    "carry_pct": "Carried interest rate expressed as a percentage."
}