{
    "fund": "Free-text categorical strings giving the fund’s short name; values are alphabetic words (proper names) optionally followed by “Fund/Fund X”, “Partners,” etc., and may include Roman numerals or decimal numbers (e.g., “Fund II”, “Fund 1.5”). No fixed length or special formatting beyond standard ASCII letters, spaces, and occasional digits.",
    "forecastirr": "Numeric percentage values stored as Decimal numbers (six-place precision) representing IRR percentage points, possibly negative or positive, with no “%” sign or other formatting.",
    "forecast_moic": "1. Numeric ratio stored as a decimal value with up to 6 digits after the point (e.g., 0.700000, 2.300000).  \n2. Continuous numerical data representing a positive MOIC multiple, generally ranging from <1.0 to about 3.0+.  \n3. Uses standard fixed-precision DECIMAL/NUMERIC format; no currency symbols, thousand separators, or categorical codes.",
    "current_irr": "Fixed-precision numeric (Decimal, scale 6) storing the fund’s latest internal rate of return as a plain percentage value (no “%” symbol), allowing both negative and positive numbers roughly within –100 to +100.",
    "current_moic": "Decimal numeric field: positive ratio formatted as DECIMAL(8,6) ‑ six digits after the decimal point (e.g., 0.700000, 3.100000). Continuous numerical values representing the current multiple on invested capital; no currency symbols or special codes involved.",
    "geography": "Categorical text field containing country or broad regional names; each value is a capitalized alphabetic string (e.g., “China”, “US”, “Global”) with no special characters, numerics, or fixed codes.",
    "sector": "Categorical text field storing the fund’s primary industry sector, expressed as title-case words (sometimes combined with “/” to indicate multiple related sectors), e.g., “Diversified”, “Real Estate”, “Logistic/ Data Center”.",
    "asset": "Categorical text code where each value begins with an upper-case asset-class abbreviation (“PE”, “HF”, etc.), optionally followed by “ – ” (hyphen + spaces) and a capitalized strategy descriptor (e.g., “Buyout”, “VC / Growth”); values conform to the pattern  ^[A-Z]{1,3}( – [A-Za-z /]+)?$.",
    "nature": "Categorical text field storing controlled investment-nature labels: each value is a single, alphabetic word or acronym (A–Z, case-capitalized, no spaces/punctuation) taken from a predefined list such as “Private”, “Public”, “FinTech”, “PIPP”, “VC”.",
    "investment_date": "Calendar date stored as a true DATE field (Python dtype `datetime.date`) in ISO-8601 “YYYY-MM-DD” format; each value is a single point-in-time (no time component) representing the day an investment/commitment began.",
    "committed": "Numeric monetary field: a positive Decimal/NUMERIC value stored without currency symbol, always expressed to two fractional digits (e.g., 10000000.00), representing the limited partner’s capital commitment in the original fund currency.",
    "funded": "1. Numeric currency amounts recorded as positive decimals with exactly two digits after the point (e.g., 1756064.00).  \n2. Continuous numerical values representing cumulative capital called; no text, symbols, or thousand separators—plain decimal notation in base-10.",
    "o_s": "1. Signed decimal currency amounts with two fixed decimal places (e.g., -10635803.00), typically up to 11-12 digits left of the decimal and always “.00”.  \n2. Continuous numerical values; negative values denote over-funding while positive values (not shown) would indicate capital still to be funded.",
    "distribution": "1. Numeric currency amount stored as a positive DECIMAL with two fixed decimal places (e.g., 4158211.00).  \n2. Continuous numerical values representing total cash + stock distributions in USD; no text, codes, or symbols included.",
    "current_mtm_value": "1. Numeric monetary field stored as a fixed-precision Decimal with two scale places (e.g., 2093389.00).  \n2. Holds positive mark-to-market amounts in USD; values are continuous numerical (no categorical codes) with no special prefixes or symbols.",
    "total_earned": "Signed fixed-point currency amount: optional leading “-” followed by one or more digits and a decimal point with exactly two digits (regex ­-? \\d+\\. \\d{2} ), e.g., -1570640.00 or 18875000.00. Represents continuous numerical dollar values for net gain/loss, using standard decimal notation without any thousands separators.",
    "fund_full_name": "Free-form proper-case text giving the full legal fund name: multiple capitalized words, optional commas, numerals/roman numerals to denote series, and ending with the legal entity suffix “L.P.”/“LP”.  \nValues are categorical string identifiers (no numeric calculations) that follow common private-fund naming conventions rather than a fixed coded format.",
    "initial_closing_date": "Dates are stored as individual calendar dates in ISO-8601 “YYYY-MM-DD” format, each representing the fund’s first closing date when investor commitments were accepted. The column therefore contains discrete, non-categorical date values with no additional symbols or time components.",
    "final_closing_date": "ISO-8601 calendar date (YYYY-MM-DD) stored as a date object, representing the fund’s final fundraising closing date; values are discrete dates with no time component, following standard Gregorian calendar conventions.",
    "vintage_year": "Four-digit integer in YYYY calendar-year format (e.g., 2011-2024); represents the fund’s vintage year and may be NULL where unknown. Values are discrete annual categories rather than continuous ranges.",
    "general_partner_gp": "Alphanumeric text strings that state the full legal name of each fund’s general-partner entity; names are categorical free-text and typically contain capitalized words plus organizational suffixes (e.g., “GP”, “L.P.”, “Ltd.”, “LLC”) and may include fund numbers/roman numerals and jurisdiction notes in parentheses.",
    "investment_manager": "Free-text categorical strings containing the full legal name of the investment-management firm: the name may include an optional descriptor or prefix (e.g., “Advisor:”), corporate suffixes/abbreviations (LLC, Ltd., Limited), and parentheses or commas giving jurisdiction or location (e.g., “(Cayman)”). No fixed formatting beyond typical English corporate-naming conventions; values are case-sensitive and may contain spaces and punctuation.",
    "fund_term": "Semi-structured text strings that state the contractual fund term, usually in the pattern  \n• “<integer> years from <reference event>” or  \n• “<YYYY/MMM YYYY> (<integer> years from <reference event>)”.  \n\nValues are categorical text that combine a numeric duration (in years) with a descriptive reference point (“Final Closing Date”, “inception”, etc.); no formal date or numeric standard beyond the four-digit year/month abbreviation and plain-language wording.",
    "extensions": "Semi-structured text: one or more integers combined with the word “year/years”, usually in patterns like “X + Y”, “X+Y”, or “N, 1 year periods”, sometimes followed by a free-text qualifier; stores categorical descriptions of permitted extension periods (number of one-year extensions); NULL allowed.",
    "investment_period": "Free-text field storing either  \n1) an absolute date in “dd-MMM-yyyy” or “Mon yyyy” format, or  \n2) a relative duration expressed as “<integer> years from <reference event>” (optionally followed by extensions in “+ <integer> year” wording).  \nValues are categorical text; no strict standard beyond these two recurring patterns.",
    "fund_currency": "Stores the fund’s reference currency as a categorical 3-letter ISO 4217 currency code (e.g., “USD”); field may be null when the currency is unspecified.",
    "fund_size_total_commitment": "1–2 sentence format description:\n\nString‐encoded currency amounts: optional “US$” prefix, 1–4 digit number with optional decimals, followed by an optional space and a magnitude suffix (m/mil/million = millions, b/bil = billions). Values are textual representations of USD commitments, not yet normalized to a pure numeric field.",
    "minimum_commitment": "Strings representing a monetary commitment: optional currency symbol/abbreviation (e.g., “US$”), a number (integer or decimal), and an “m” or “mil” million-indicator, sometimes followed by free text notes; nulls allowed.",
    "gp_commitment": "Values are expressed either as a percentage (integer or 1-decimal number followed by “%”, optionally with a trailing explanatory phrase) or as a U.S.-dollar amount prefixed by “US$” (or implicit USD) and suffixed with “k” (thousands) or “mil” (millions), allowing optional decimals.",
    "financial_year_end": "ISO-8601 calendar date (YYYY-MM-DD) capturing the fund’s fiscal year-end; stores discrete date values per record, with NULL/blank permitted when the year-end is not available.",
    "accounting_principles": "Categorical text field storing the abbreviated name of the accounting framework (e.g., “US GAAP”, “IFRS”); values are short, upper-case strings (2–10 characters, may include a space) drawn from recognized accounting standards, with null/blank permitted for unknown.",
    "fund_performance_indicator": "Values are date strings in the format DD-MMM-YYYY (e.g., “31-Dec-2024”) using English three-letter month abbreviations, or the field is null. Thus the column holds date-type text (with optional NULLs) following the standard dd-MMM-yyyy convention.",
    "fair_value_of_porfolio_companies_usdol_mil": "Decimal numeric values (positive), expressed without a currency symbol, with up to 6 digits after the decimal point; each number denotes the fair-value amount in millions of U.S. dollars.",
    "total_net_asset_value_usdol_mil": "Numeric field storing positive decimal numbers (e.g., 0.070000–85.600000) formatted as DECIMAL with up to 6 digits after the point; represents the fund’s latest net asset value expressed in millions of U.S. dollars (USD).",
    "fund_gross_multiple_x": "Numeric field holding gross MOIC ratios: positive decimal numbers (≥0) written in standard notation with up to one-digit precision before the decimal (occasionally more) and exactly six digits after the decimal (e.g., 1.300000). No currency symbols or text; purely continuous numerical values representing multiples.",
    "fund_net_multiple_x": "Numeric ratio stored as a positive Decimal with up to six fixed-precision places (e.g., 1.200000, 2.100000); NULL permitted when value is unavailable.",
    "fund_gross_irr_pct": "Numeric decimal values (precision up to 6 decimal places) representing the fund’s gross internal rate of return expressed as whole-number percentages (e.g., 11 = 11 %), with nulls permitted for missing data.",
    "fund_net_irr_pct": "1. Values are stored as Decimal numbers with six-place fixed scale (e.g., 10.000000) representing percentage rates.  \n2. Numerical/continuous data, typically 0–100 (may be negative for under-performance); NULL indicates missing value.  \n3. Expressed as net IRR percentages to LPs after fees/carry; follows a “[sign]NNN.NNNNNN %” convention without the percent symbol in the field.",
    "fund_distribution_to_paid_in_capital_dpi_pct": "1. Numeric field storing DPI percentages as Decimal numbers with up to two digits after the decimal point (e.g., 0.00, 238.30); NULL permitted for missing data.  \n2. Values represent percentage rates (0 – >300 %), not fractions, following standard percentage notation without the “%” symbol.",
    "ccg_performance_indicator": "Categorical field holding the bank’s internal performance rating code—usually a short alphabetic or alphanumeric identifier such as “A”, “B2”, “C-”, etc.—with NULLs permitted; codes follow a proprietary in-house classification scheme rather than any external standard.",
    "commitment_usdol_mil": "Numeric field storing positive decimal values (up to 6 digits after the decimal) that represent the investor’s committed capital in millions of U.S. dollars; values are continuous (no categorical coding) and implicitly follow the convention “value × USD 1 million.”",
    "ownership_pct": "Fixed-precision numeric field: a real number with up to three digits before the decimal and exactly six digits after it (e.g., 0.500000), representing the investor’s percentage ownership (0–100) expressed as a plain number without a “%” symbol.",
    "remaining_unfunded_commitment_usdol_mil": "1. Fixed-precision decimal numbers with exactly six digits after the decimal point (e.g., -9.700000) representing monetary amounts expressed in millions of U.S. dollars.  \n2. Continuous numerical values (positive or negative) rather than categories.",
    "cumulative_distribution_usdol_mil": "Numeric field stored as a DECIMAL/NUMERIC with six fixed decimal places (e.g., 0.120000 → $0.12 M), holding non-negative, continuous monetary amounts expressed in millions of U.S. dollars.",
    "capital_account_balance_usdol_mil": "Numeric decimal field: positive, up-to-6-decimal precision values (e.g., 0.000000, 15.300000) expressing the investor’s NAV in millions of U.S. dollars.",
    "call_up_percentage_pct": "Numeric percentage expressed as a positive decimal number (precision up to 6 places, e.g., 64.500000) representing the portion of an investor’s commitment that has been called; stored as a whole-number percent (0–100+, where values may exceed 100 to reflect over-calls).",
    "distribution_to_paid_in_capital_dpi_pct": "1. Numeric percentage stored as a Decimal number with a dot (.) decimal separator and exactly two digits after the decimal point (e.g., 0.00, 17.80, 69.30).  \n2. Continuous numerical values ranging from 0.00 to 100.00+ representing the investor’s DPI ratio; no text, symbols, or thousand separators.",
    "multiple_x": "Numeric ratio stored as a positive Decimal/float with up to six digits after the decimal (e.g., 0.700000 → 4.100000), representing the investor’s multiple on invested capital (TVPI/MOIC); values are continuous quantitative measures where 1.000000 denotes break-even.",
    "irr_pct": "1. Signed numeric percentage expressed as a decimal (e.g., -38.400000), stored without a “%” symbol.  \n2. Continuous numerical values (can be negative or positive) with six digits after the decimal point.  \n3. Standard fixed-precision DECIMAL representation of internal rate of return; units are percent.",
    "fee_term": "Free-form UTF-8 text field containing narrative descriptions of management-fee terms (e.g., percentage rates, basis-point tiers, timing clauses); values are unstructured prose rather than standardized codes or numeric ranges. No fixed pattern—content may mix words, numbers, currency symbols, and date/period references as needed.",
    "management_fees_investment_period": "Text strings that start with a numeric percentage (integer or decimal) followed by the “%” sign, optionally followed by a descriptive suffix such as “of commitment/aggregate capital/net invested capital” (may also include phrases like “per annum”); essentially categorical percentage-rate descriptors with possible null/blank entries.",
    "management_fees_after_investment_period": "Free-text strings of the form “<percentage or percentage range>% [per annum] of/on <fee-base>”, e.g., “2% of commitment” or “0.69 to 1.35% of aggregate capital”.  \nValues are categorical text expressing management-fee rates (percentages) and the capital basis to which they apply; no strict numeric formatting but the convention is a percentage followed by the descriptive basis.",
    "preferred_return": "String-encoded percentage rates: an integer (optionally decimal) followed immediately by the “%” symbol (e.g., “8%”), with NULL/blank entries permitted; values represent numerical hurdle-rate percentages promised to limited partners before carry.",
    "carried_interest": "Values are stored as strings representing whole‐number percentages (1–3 digits immediately followed by a “%”, e.g., “10%”, “15%”, “20%”); NULL denotes missing data.",
    "lp_reporting_timeline": "Free-form text field storing narrative timelines/requirements, typically phrases that may include frequency terms (“monthly”, “quarterly”, “annual”) and/or date references (e.g., “2024-06-30”, “Q1-2025”); values are unstructured strings with no enforced format standards.",
    "quarterly_report_after_period_end": "Values are stored as a string in the pattern “<integer> days” (e.g., “45 days”, “60 days”, “90 days”); it represents the numeric day-count after quarter-end and may be NULL when not provided.",
    "annual_report_after_period_end": "String field recording the deadline as “<integer> days” or “<integer> business days” (e.g., “90 days”, “120 days”); text representation of a numerical count with an optional “business” qualifier, allowing nulls for missing data.",
    "drawdown_notice": "Values are stored as short duration strings of the form “<integer> <time-unit>” (e.g., “10 days”, “30 days”, “2 weeks”), indicating the notice period; the field is text (categorical/ordinal duration) and may contain NULL when no notice is specified.",
    "dpi_x": "Numeric DECIMAL field storing a Distribution-to-Paid-In multiple (DPI) as a unit-less factor: positive real numbers written with a fixed decimal point and six fractional digits (e.g., 0.670000 represents 0.67× paid-in capital).",
    "rvpi_x": "1. Numerical column storing non-negative decimal numbers (base-10) with up to six digits after the point, e.g., 0.000000 – 0.740000.\n2. Values represent the RVPI multiple as a unit-less factor (≥0), following standard financial convention of six-place, fixed-precision decimals rather than percentages.",
    "tvpi_moic_x": "Numeric decimal values with three-place precision (e.g., 0.680) representing the TVPI/MOIC multiple factor; continuous, non-negative ratios typically ranging from <1.0 to several x, stored without a currency symbol or “x” suffix.",
    "irr": "1. Signed decimal-number format: optional minus sign, 1–2 integer digits, a dot, and exactly six fractional digits (pattern: ‑?##.######).  \n2. Stores continuous numerical IRR percentages that may be positive or negative; no categorical codes or other symbols are used.",
    "upside": "Numeric column storing absolute unrealised gains as signed decimal currency amounts: an optional minus sign followed by one or more digits and exactly two fractional digits (pattern ­-?\\d+.\\d{2}), representing monetary values in base currency.",
    "total": "Single-digit numeric flag stored as text (e.g., \"0\", \"1\"), representing categorical status/allocation codes; values are whole-number characters with no decimals, signs, or separators.",
    "moic": "Decimal numeric field (e.g., 0.700000–3.100000) storing a continuous ratio/multiple-on-invested-capital value; plain numeric string with up to six fractional digits, no currency symbols or special codes, typically ranging from <1.0 to ~5.0.",
    "irr_1": "Signed decimal numeric field (Python Decimal), optionally prefixed with “-” for negative values, always shown with six digits after the decimal (e.g., -93.000000, 22.000000); represents an IRR percentage value, not accompanied by any currency or symbol.",
    "inception": "ISO-8601 dates in “YYYY-MM-DD” form (stored as Python `datetime.date` objects), always set to the first day of the month, representing the inception date of each commitment/share class.",
    "expiry": "Dates are stored as ISO-8601 calendar dates (YYYY-MM-DD), held as date/datetime values; each entry is a discrete contractual expiry date (always recorded as the first day of the month).",
    "entity": "Variable-length categorical text field: 2–30 character strings that are either all-caps alphanumeric acronyms (e.g., “BII”, “CCGBVI”) or mixed-case legal names that may include spaces and common company suffixes like “Ltd”. No fixed industry code or formal standard is enforced.",
    "fee_pct": "Numeric decimal values with up to 6 decimal places (e.g., 1.000000–2.000000) representing a management-fee percentage; accepts NULL for missing data.",
    "carry_pct": "Numeric percentage expressed as a DECIMAL value (0-100) with exactly six digits after the decimal point (e.g., 10.000000, 15.000000); stored as a pure number—no “%” symbol—following standard fixed-precision SQL DECIMAL conventions."
}