{
    "fund": "Free-text string identifying the investment fund: capitalized words separated by spaces, may include numbers or Roman numerals (e.g., “II”, “XIV”), legal suffixes like “LP”, punctuation, and parenthetical “AKA …” aliases.  \nValues are categorical text labels (no fixed code or numeric format).",
    "portfolio": "Free-text, categorical company/SPV names: mixed-case strings that may contain legal-entity suffixes (LLC, Ltd, SAS, etc.), stock-ticker/market codes or translations in parentheses, punctuation, numerals, and non-Latin characters. No fixed length or standard code format—values are arbitrary legal names used for identification.",
    "company_description": "Free-form narrative text (typically one phrase to several sentences) describing the company’s business model, products, and market position; entries are unstructured strings that may mix English and Chinese characters, include punctuation/quotation marks, and can be NULL.",
    "sector": "Categorical text field containing capitalized industry‐sector labels selected from a predefined list; values are plain strings (single or multi-word, spaces allowed) and may include the placeholder “-” or NULL for unknown entries.",
    "status_unrealized_partial_realized_realized_write_off": "Categorical text field containing one of four predefined status strings—“Unrealized”, “Partial Realized”, “Realized”, or “Write-off”; a lone hyphen “-” is used to denote missing/unknown data.",
    "first_investment_date": "Stores nullable calendar dates as native DATE values (ISO-8601 ‑- ‘YYYY-MM-DD’, typically the first day of the month, e.g., 2011-08-01); no other data types or codes appear.",
    "ipo_date": "ISO-8601 calendar date (YYYY-MM-DD) stored as a Python datetime.date object; nullable field where None signifies no IPO recorded.",
    "ticker": "Categorical text field containing stock-exchange ticker symbols: Hong Kong listings are 3-5 digit numeric codes (often zero-padded) followed by “.HK” or “ HK”, U.S. listings appear as “NYSE:” plus 1–4 uppercase letters, while “-” or NULL denote “not applicable.”",
    "exit_date": "Dates are stored as discrete calendar values in ISO-8601 “YYYY-MM-DD” format (e.g., 2021-12-01) using a date-only data type; each record represents the exact day a fund fully exited, with NULL/blank meaning no exit yet.",
    "exit_method": "Categorical text field (varchar) holding short, case-insensitive labels for the exit type; values come from a controlled list such as “IPO”, “Market sale”, “Strategic sale”, “Trade sale”, “Secondary sale”, “Write Off”, with missing/unknown entries stored as NULL or the placeholder “-”.",
    "holding_period_years": "1. Numeric values stored as fixed-precision Decimals with two decimal places representing whole or fractional years (e.g., 0.00, 1.00, 2.00 …).  \n2. Continuous numerical field; NULL allowed to denote missing/unknown holding period."
}