{
    "fund": "Name of the private‐equity or investment fund to which the cash-flow entry relates.",
    "transaction_type": "Category of cash movement (e.g., Capital Call, Distribution, Recallable Distribution) indicating the nature of the entry.",
    "no": "Internal reference or document identifier for the specific cash-flow event (e.g., CC#1).",
    "document_date": "Date shown on the official notice or document that initiated the cash-flow event.",
    "trans_date": "Actual settlement date on which the cash was received or paid.",
    "year": "Fiscal year to which the transaction is attributed (stored as the first day of that year).",
    "project": "Name of the underlying portfolio company or project associated with the transaction.",
    "portfolio_investment": "Portion of the transaction amount allocated to direct portfolio investments (recorded as a string due to formatting with commas).",
    "mgmt_fee": "Dollar amount of management fees included in the cash-flow event.",
    "partnership_exp": "Amount classified as partnership operating expenses in the transaction.",
    "org_fee": "Organizational or formation fee charged in connection with the cash-flow event.",
    "others": "Miscellaneous amounts that do not fall into the predefined expense categories.",
    "trans_amt": "Total net amount of the cash-flow transaction (negative for capital calls, positive for distributions).",
    "cum_capital_called": "Cumulative capital that has been called from investors up to and including this transaction.",
    "remaining_callable_capital": "Unfunded commitment still available to be called from investors after this transaction.",
    "distributions": "Gross distribution amount paid out to investors in this transaction.",
    "cum_dist_before_carry": "Total distributions to investors before deducting carried interest, aggregated to date.",
    "carry_interest": "Carried interest allocated to the general partner for this transaction.",
    "carried_interest_received_as_co_gp": "Carried interest actually received by the co-general partner in this transaction.",
    "withholding_tax": "Amount of withholding tax deducted from the distribution.",
    "recycled_amount": "Portion of a prior distribution that is recalled (recycled) as new callable capital.",
    "distributions_after_carried": "Net distribution to limited partners after deducting carried interest for this transaction.",
    "cum_dist_after_carry": "Cumulative net distributions to investors after carried interest up to this point.",
    "capital_account_balance": "Investor’s ending capital account balance following this transaction.",
    "notes": "Free-text comments or explanations related to the cash-flow entry."
}