{
    "fund": "1. Variable-length, free-text string of proper-noun fund names that may include spaces, mixed-case letters, numerals, Roman numerals, punctuation/hyphens, and optional parenthetical “AKA …” aliases.  \n2. Categorical (nominal) values; each distinct string uniquely identifies an investment/private-equity fund, with no fixed code or numeric pattern beyond standard naming conventions.",
    "transaction_type": "Categorical text field: title-case alphabetic strings (1–4 words, 5–30 chars) describing the cash-flow category, e.g., “Capital Call”, “Distribution”, “Recallable Distribution”; may include additional narrative words (“Partial refund of …”) and accepts null/blank values.",
    "no": "1. Alphanumeric code pattern: two uppercase letters (e.g., CC, DD) + “#” + 1–2-digit integer (e.g., CC#24).  \n2. Stores categorical reference identifiers; uses the fixed “AA#nn” convention with optional null/blank entries.",
    "document_date": "Dates stored as DATE/ISO-8601 values in “YYYY-MM-DD” format, representing the document’s stated date; field may be NULL when no date is recorded.",
    "trans_date": "ISO-8601 calendar dates in the form YYYY-MM-DD, stored as a DATE datatype with no time or timezone component; each value represents a single settlement day on which cash was actually received or paid.",
    "year": "ISO-8601 date values stored as the first calendar day of each fiscal year (pattern: YYYY-01-01, e.g., 2013-01-01), with one distinct date per year; may also contain NULLs.",
    "project": "Free-text, proper-noun strings (letters, spaces, occasional punctuation such as hyphens or “/”) that identify company or project names; purely categorical values with multiple names sometimes concatenated and separated by “/”.",
    "portfolio_investment": "String-encoded monetary amounts: optional parentheses to denote negatives, digits grouped with comma thousands-separators (e.g., #,### or #,###,###), and an optional decimal part with up to two digits (e.g., .00); stored as text with nulls allowed.",
    "mgmt_fee": "1. Signed USD currency amounts stored as DECIMAL values: optional minus sign, up to ­≈10 digits before the point, and exactly 2 digits after (e.g., -2153425.00).  \n2. Numerical/continuous; accepts NULL when no fee is recorded.",
    "partnership_exp": "Signed high-precision numeric field: a DECIMAL amount (typically ±9999999.9999) stored with four digits after the decimal point and no currency symbol, allowing negative, positive, or NULL values to represent partnership operating expenses.",
    "org_fee": "Signed fixed-precision decimal amount (optional “-” sign) with exactly two digits after the period (±999999.99), representing the fee in USD; accepts NULL when no fee is recorded.",
    "others": "Stores positive monetary amounts as fixed-precision decimals (15,4) – e.g., 15744.0000 – or NULL when no value exists; essentially numerical (continuous) “other” expense figures expressed in standard currency format with four digits after the decimal point.",
    "trans_amt": "Signed currency amount stored as a fixed-precision Decimal: optional “-” sign followed by 1-10 digits and a dot with exactly four fractional digits (regex-like pattern: ^\\-?\\d+\\.\\d{4}$).  \nValues are continuous numeric (no separators), where negatives denote capital calls and positives denote distributions.",
    "cum_capital_called": "• Numeric field storing monetary amounts as signed decimals with exactly two digits after the decimal point (e.g., -13 371 567.00); nullable (can be NULL).  \n• Continuous numerical values representing cumulative capital called; negative sign denotes capital drawn, using standard financial “currency amount” convention (assumed base currency of the fund).",
    "remaining_callable_capital": "1. Numeric currency amounts expressed as positive Decimals with two fixed decimal places (e.g., 65395890.00); field may be null.  \n2. Continuous numerical values representing unfunded capital, stored as nullable Decimal numbers following standard currency formatting.",
    "distributions": "Positive monetary amount stored as a Decimal numeric value (up to two digits after the decimal point, no currency symbol) representing gross cash distributions; field may be null when no payment exists.",
    "cum_dist_before_carry": "1. Monetary amount stored as a positive Decimal/NUMERIC value with up to four digits after the decimal point (e.g., 74580605.0000).  \n2. Continuous numerical values (financial totals); NULL allowed to indicate missing data.",
    "carry_interest": "1. Signed fixed-precision decimal number with up to four digits after the decimal point (e.g., –587487.0000, 115478.9500); NULL permissible.  \n2. Represents a monetary amount (carried interest) in dollars, so values are continuous numerical and may be positive or negative.",
    "carried_interest_received_as_co_gp": "Numeric currency field: positive DECIMAL values (usually USD) recorded to four decimal places (e.g., 206943.2600); may be NULL when no carried-interest was received.",
    "withholding_tax": "1. Numeric monetary amount stored as a fixed-point Decimal with up to 4 digits after the decimal (e.g., 247256.0000); nulls indicate no tax withheld.  \n2. Continuous numerical values representing currency (withholding-tax) amounts, following standard decimal-currency formatting.",
    "recycled_amount": "1. Fixed-precision currency/amount field: positive decimal numbers with up to 10+ integral digits and exactly 4 digits after the decimal point (e.g., 1 572 886.0000); nulls allowed.  \n2. Numerical (continuous), representing monetary values expressed in the fund’s base currency; stored as Decimal with scale 4.",
    "distributions_after_carried": "Decimal monetary amount (USD) stored as Decimal(18,4) – positive whole-dollar values recorded with four fixed decimal places (e.g., 1072619.0000); field may also be NULL when no distribution is recorded.",
    "cum_dist_after_carry": "1. Monetary amount stored as a Decimal: optional sign, up to ~10-11 digits before the point, followed by a dot and exactly 4 fractional digits (e.g., 1375940.0400).  \n2. Continuous numerical values (currency/financial figures) with NULL permitted for missing data; no other special codes or text.",
    "capital_account_balance": "Numeric currency amount stored as a Decimal with up to several digits before the decimal point and exactly four digits of precision (e.g., 121791.0000); field may be NULL when the balance is unavailable.",
    "notes": "Free-text comment field; most entries follow the pattern “[Tied/Ties/tie] to/with YYYY Q#(,Q# …) CAS”, i.e., a verb phrase followed by a 4-digit year, one or more quarter codes (Q1–Q4) optionally comma-separated, and the literal “CAS”. Values are short categorical text strings referencing specific year-quarter CAS reports."
}