{
    "fund": "1. Free-text, mixed-case strings representing fund names; words separated by spaces and may include Arabic or Roman numerals, legal suffixes (e.g., “LP”), punctuation, and parenthetical AKA aliases.  \n2. Categorical (nominal) values—each distinct string is a unique fund identifier; no fixed enumeration but follows naming conventions common in private-equity funds.",
    "investment": "Free-text, proper-noun strings identifying portfolio companies or assets; values are categorical names that may include legal suffixes (e.g., “LLC”, “Ltd”), mixed-language characters, and optional parenthetical notes such as local script names or exchange/ticker codes. No fixed pattern beyond standard company/asset naming conventions.",
    "quarter": "Values are textual period codes in the pattern “Q[1-4] YYYY”: the letter “Q” plus fiscal quarter 1-4, a space, and a four-digit year (e.g., “Q4 2023”).  \nThis is a categorical text field following a simple quarter-year convention, not a date datatype.",
    "investment_cost_usd_mil": "Numeric decimal value (no currency symbol), positive or zero, representing millions of U.S. dollars; up to 6 digits before the decimal and up to 6 fractional digits (e.g., 0.524500-111.000000).",
    "pct_of_ownership": "Decimal fraction between 0 and 1 stored as NUMERIC/DECIMAL with up to four digits after the decimal point (e.g., 0.1984 = 19.84 % ownership); NULL indicates missing data.",
    "realized_value_usd_mil": "Numeric (Decimal) monetary amount expressed in millions of U.S. dollars: plain number (no $, commas, or sign) with up to six digits after the decimal point; field is continuous/quantitative and may be NULL.",
    "unrealized_value_usd_mil": "Numeric, continuous field storing the fair-value amount in millions of U.S. dollars: positive decimal numbers with up to six fractional digits (e.g., 14.000000, 77.624974); NULL represents missing data.",
    "total_value_usd_mil": "Numeric decimal field (positive real numbers, standard base-10 notation without currency symbols or commas) carrying U.S.–dollar amounts already scaled to millions; accepts up to six digits after the decimal and may be NULL.",
    "moic": "1. Format: Positive decimal number with optional leading digits and up to 6 digits after the decimal point (e.g., 0.333497, 2.193017).  \n2. Value type: Continuous numerical ratio (dimensionless multiple on invested capital), typically ≥ 0.",
    "irr": "1. Numeric decimal field storing signed values with up to six digits after the point (e.g., -0.130000, 0.649000).  \n2. Continuous numerical measure representing the annualized IRR as a fraction (0.12 = 12 %), so values can be positive or negative; usually within roughly –1 to 1 but not formally bounded.",
    "total_value_dol_change_yoy": "Numeric decimal field (nullable) storing the year-over-year absolute change in total value, expressed in millions of U.S. dollars; values can be positive or negative and are recorded as Decimals with up to two fractional digits (e.g., -14.00, 13.80).",
    "total_value_pct_change_yoy": "Signed Decimal(5,4) numeric field holding the year-over-year percentage change (–1.0000 to +1.0000 range, four digits after the decimal); accepts NULL when the value is not available."
}